[
    {
        "title": "Weather App",
        "description": "Developed a weather website using HTML, CSS, and JavaScript, ensuring real-time data retrieval from API for precise forecasts.",
        "technologies": [
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "features": [
            "Seamlessly integrated weather API for up-to-date and accurate weather forecasts, demonstrating expertise in API usage and data manipulation, resulting in a 30% improvement in data retrieval efficiency compared to previous implementations.",
            "Designed an intuitive interface tailored for easy access to weather data, leveraging JavaScript optimizations to enhance interactivity, resulting in a significant 70% boost in user satisfaction."
        ],
        "date": "Jan-2024",
        "githubLink": "https://github.com/AniOpd/web-dev-/tree/master/weather",
        "demoLink": "https://weatherappbyanish.netlify.app",
        "projectImage": "https://res.cloudinary.com/dw9evtmee/image/upload/v1718087613/pkrnkran3mehpgeryzos.png"
    },
    {
        "title": "E-commerce Website",
        "description":"Engineered an immersive e-commerce platform utilizing fundamental web technologies such as HTML, CSS, and JavaScript, emphasizing user-friendly design and seamless functionality.",
        "technologies": [
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "features":[
            "Facilitating one-click cart addition and real-time inventory updates for effortless shopping experiences and informed choices, boosting user confidence by 90%.",
            "Employed JavaScript for interactive functionality, event management, data manipulation, and DOM updates to significantly enhance site responsiveness by 85%.",
            "Launched on Netlify, ensuring optimal accessibility and performance for end-users."
        ],
        "date": "Jan-2024",
        "githubLink": "https://github.com/AniOpd/EcommerceProjectjs",
        "demoLink": "https://startling-swan-f402de.netlify.app",
        "projectImage": "https://res.cloudinary.com/dw9evtmee/image/upload/v1718421815/t8x1x2a7gkgdcoae6a0m.png"
    }
]